FIOLOG/nvme0n1_220601_164832_fio.log
/dev/nvme0n1: (g=0): rw=randwrite, bs=(R) 512B-64.0KiB, (W) 512B-64.0KiB, (T) 512B-64.0KiB, ioengine=libaio, iodepth=16
...
fio-3.28
Starting 2 processes

/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=131511: Wed Jun  1 16:48:53 2022
  write: IOPS=134, BW=1032KiB/s (1056kB/s)(20.2MiB/20077msec); 0 zone resets
    slat (usec): min=6, max=488, avg=18.72, stdev=19.87
    clat (msec): min=2, max=314, avg=117.43, stdev=57.70
     lat (msec): min=2, max=314, avg=117.45, stdev=57.70
    clat percentiles (msec):
     |  1.00th=[    5],  5.00th=[   29], 10.00th=[   41], 20.00th=[   79],
     | 30.00th=[   86], 40.00th=[  109], 50.00th=[  113], 60.00th=[  132],
     | 70.00th=[  140], 80.00th=[  165], 90.00th=[  190], 95.00th=[  218],
     | 99.00th=[  284], 99.50th=[  292], 99.90th=[  305], 99.95th=[  313],
     | 99.99th=[  313]
   bw (  KiB/s): min=  404, max= 1833, per=50.85%, avg=1031.58, stdev=327.20, samples=40
   iops        : min=   88, max=  224, avg=134.13, stdev=32.94, samples=40
  lat (msec)   : 4=0.63%, 10=1.11%, 50=8.95%, 100=26.17%, 250=59.89%
  lat (msec)   : 500=3.25%
  cpu          : usr=0.13%, sys=0.38%, ctx=609, majf=0, minf=9
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.3%, 16=99.4%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,2705,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=131512: Wed Jun  1 16:48:53 2022
  write: IOPS=134, BW=1000KiB/s (1024kB/s)(19.7MiB/20163msec); 0 zone resets
    slat (usec): min=7, max=745, avg=20.16, stdev=23.81
    clat (msec): min=3, max=375, avg=117.72, stdev=58.96
     lat (msec): min=3, max=375, avg=117.74, stdev=58.96
    clat percentiles (msec):
     |  1.00th=[    6],  5.00th=[   29], 10.00th=[   53], 20.00th=[   81],
     | 30.00th=[   85], 40.00th=[  107], 50.00th=[  110], 60.00th=[  115],
     | 70.00th=[  136], 80.00th=[  159], 90.00th=[  194], 95.00th=[  234],
     | 99.00th=[  317], 99.50th=[  321], 99.90th=[  376], 99.95th=[  376],
     | 99.99th=[  376]
   bw (  KiB/s): min=  470, max= 1901, per=49.47%, avg=1003.18, stdev=359.20, samples=40
   iops        : min=   84, max=  224, avg=134.37, stdev=33.92, samples=40
  lat (msec)   : 4=0.74%, 10=0.55%, 20=0.18%, 50=6.86%, 100=28.34%
  lat (msec)   : 250=60.22%, 500=3.10%
  cpu          : usr=0.12%, sys=0.42%, ctx=606, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.3%, 16=99.4%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,2710,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
  WRITE: bw=2027KiB/s (2076kB/s), 1000KiB/s-1032KiB/s (1024kB/s-1056kB/s), io=39.9MiB (41.9MB), run=20077-20163msec

Disk stats (read/write):
  nvme0n1: ios=10797/181690, merge=0/0, ticks=1300699/22578043, in_queue=23878741, util=100.00%