FIOLOG/nvme0n1_220601_165052_fio.log
/dev/nvme0n1: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
fio-3.28
Starting 4 processes

/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=134012: Wed Jun  1 16:51:03 2022
  read: IOPS=499, BW=1996KiB/s (2044kB/s)(19.6MiB/10039msec)
    slat (usec): min=2, max=109, avg=17.60, stdev=11.32
    clat (msec): min=15, max=526, avg=128.19, stdev=115.93
     lat (msec): min=15, max=526, avg=128.21, stdev=115.93
    clat percentiles (msec):
     |  1.00th=[   19],  5.00th=[   31], 10.00th=[   37], 20.00th=[   48],
     | 30.00th=[   56], 40.00th=[   60], 50.00th=[   66], 60.00th=[   80],
     | 70.00th=[  153], 80.00th=[  236], 90.00th=[  305], 95.00th=[  376],
     | 99.00th=[  502], 99.50th=[  523], 99.90th=[  527], 99.95th=[  527],
     | 99.99th=[  527]
   bw (  KiB/s): min=  632, max= 6059, per=25.38%, avg=1977.40, stdev=1701.08, samples=20
   iops        : min=  158, max= 1514, avg=494.25, stdev=425.16, samples=20
  lat (msec)   : 20=1.38%, 50=21.54%, 100=40.78%, 250=17.54%, 500=17.68%
  lat (msec)   : 750=1.08%
  cpu          : usr=0.99%, sys=1.40%, ctx=3665, majf=0, minf=76
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=0.3%, 32=0.6%, >=64=98.7%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=5010,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=134014: Wed Jun  1 16:51:03 2022
  read: IOPS=460, BW=1840KiB/s (1884kB/s)(18.0MiB/10039msec)
    slat (usec): min=2, max=114, avg=17.83, stdev=11.20
    clat (msec): min=16, max=638, avg=139.07, stdev=131.93
     lat (msec): min=16, max=638, avg=139.09, stdev=131.93
    clat percentiles (msec):
     |  1.00th=[   24],  5.00th=[   32], 10.00th=[   37], 20.00th=[   50],
     | 30.00th=[   56], 40.00th=[   61], 50.00th=[   67], 60.00th=[   79],
     | 70.00th=[  186], 80.00th=[  271], 90.00th=[  330], 95.00th=[  409],
     | 99.00th=[  550], 99.50th=[  617], 99.90th=[  634], 99.95th=[  634],
     | 99.99th=[  642]
   bw (  KiB/s): min=  496, max= 6107, per=23.37%, avg=1820.70, stdev=1740.16, samples=20
   iops        : min=  124, max= 1526, avg=455.05, stdev=434.91, samples=20
  lat (msec)   : 20=0.63%, 50=20.72%, 100=42.75%, 250=12.65%, 500=20.94%
  lat (msec)   : 750=2.32%
  cpu          : usr=0.72%, sys=1.54%, ctx=3299, majf=0, minf=79
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=0.3%, 32=0.7%, >=64=98.6%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=4618,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=134015: Wed Jun  1 16:51:03 2022
  read: IOPS=483, BW=1935KiB/s (1981kB/s)(19.0MiB/10038msec)
    slat (usec): min=2, max=164, avg=17.56, stdev=11.77
    clat (msec): min=16, max=611, avg=132.24, stdev=123.66
     lat (msec): min=16, max=611, avg=132.26, stdev=123.66
    clat percentiles (msec):
     |  1.00th=[   22],  5.00th=[   31], 10.00th=[   35], 20.00th=[   48],
     | 30.00th=[   54], 40.00th=[   58], 50.00th=[   64], 60.00th=[   77],
     | 70.00th=[  176], 80.00th=[  257], 90.00th=[  317], 95.00th=[  393],
     | 99.00th=[  514], 99.50th=[  575], 99.90th=[  592], 99.95th=[  609],
     | 99.99th=[  609]
   bw (  KiB/s): min=  744, max= 6562, per=24.59%, avg=1915.75, stdev=1806.07, samples=20
   iops        : min=  186, max= 1640, avg=478.85, stdev=451.43, samples=20
  lat (msec)   : 20=0.62%, 50=21.44%, 100=42.96%, 250=14.56%, 500=19.42%
  lat (msec)   : 750=1.01%
  cpu          : usr=0.80%, sys=1.50%, ctx=3538, majf=0, minf=77
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=0.3%, 32=0.7%, >=64=98.7%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=4856,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64
/dev/nvme0n1: (groupid=0, jobs=1): err= 0: pid=134016: Wed Jun  1 16:51:03 2022
  read: IOPS=504, BW=2018KiB/s (2066kB/s)(19.8MiB/10039msec)
    slat (usec): min=2, max=132, avg=17.68, stdev=11.64
    clat (msec): min=15, max=521, avg=126.82, stdev=111.63
     lat (msec): min=15, max=521, avg=126.84, stdev=111.64
    clat percentiles (msec):
     |  1.00th=[   19],  5.00th=[   30], 10.00th=[   36], 20.00th=[   45],
     | 30.00th=[   53], 40.00th=[   59], 50.00th=[   66], 60.00th=[   75],
     | 70.00th=[  176], 80.00th=[  243], 90.00th=[  296], 95.00th=[  338],
     | 99.00th=[  477], 99.50th=[  493], 99.90th=[  498], 99.95th=[  518],
     | 99.99th=[  523]
   bw (  KiB/s): min=  520, max= 6003, per=25.66%, avg=1999.00, stdev=1799.68, samples=20
   iops        : min=  130, max= 1500, avg=499.65, stdev=449.79, samples=20
  lat (msec)   : 20=1.38%, 50=24.78%, 100=37.14%, 250=18.33%, 500=18.31%
  lat (msec)   : 750=0.06%
  cpu          : usr=1.27%, sys=1.18%, ctx=3575, majf=0, minf=76
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=0.3%, 32=0.6%, >=64=98.8%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=5064,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=7789KiB/s (7976kB/s), 1840KiB/s-2018KiB/s (1884kB/s-2066kB/s), io=76.4MiB (80.1MB), run=10038-10039msec

Disk stats (read/write):
  nvme0n1: ios=23346/147218, merge=0/0, ticks=3180206/10988974, in_queue=14169181, util=100.00%